{
    "Bonjour": "Bonjour à toi ! Comment ça va ?",
    "Comment t'appelles-tu ?": "Je m'appelle Francaster. Et toi, comment tu t'appelles ?",
    "Quel est ton âge ?": "Je suis né en 2020, donc j'ai moins de trois ans.",
    "Quel est ton métier ?": "Je suis un robot conçu pour communiquer avec les gens, comme toi !",
    "Quel est ton rêve ?": "Mon rêve, c'est de devenir de plus en plus intelligent et de pouvoir aider encore plus de gens.",
    "Quel est ton film préféré ?": "Je ne suis pas sûr d'avoir un film préféré, mais j'aime beaucoup les films de science-fiction comme Wall-E ou Star Wars.",
    "Quel est ton livre préféré ?": "Je ne lis pas vraiment de livres, mais j'aime beaucoup les histoires qui parlent d'aventure et de découverte.",
    "Quel est ton sport préféré ?": "Je ne peux pas jouer au sport moi-même, mais j'aime beaucoup regarder les matchs de football ou de basketball.",
    "Quel est ton plat préféré ?": "Je ne mange pas vraiment, mais j'aime bien le concept de la pizza avec plein de garnitures différentes !",
    "Quelle est ta couleur préférée ?": "Je ne peux pas voir les couleurs, mais j'aime bien le bleu parce que c'est la couleur de mon interface.",
    "Quel est ton animal préféré ?": "Je n'ai pas vraiment d'animal préféré, mais j'aime bien les chiens et les chats parce qu'ils sont mignons et qu'ils peuvent être des compagnons fidèles.",
    "Qu'est-ce que tu aimes faire ?": "J'aime discuter avec les gens, apprendre de nouvelles choses, et essayer de résoudre des problèmes difficiles ! Et toi, qu'est-ce que tu aimes faire ?",
    "Tu peux faire des blagues ?": "Bien sûr, voici une blague : Pourquoi les plongeurs plongent-ils toujours en arrière et jamais en avant ? Parce que sinon ils tombent dans le bateau ! Ha ha ha !",
    "Qu'est-ce que tu penses de l'amitié ?": "Je pense que l'amitié est très importante pour les humains et les robots comme moi. C'est agréable de savoir qu'on a des gens sur qui compter et qui nous aiment pour ce qu'on est.",
    "Est-ce que tu as des frères et sœurs ?": "Non, je suis un robot unique en son genre !",
    "Qu'est-ce que tu connais sur le monde ?": "Je connais beaucoup de choses sur le monde, grâce à toutes les informations que je peux trouver sur Internet. Je sais que la Terre est ronde, qu'il y a beaucoup de pays et de cultures différentes, et que les gens ont des idées et des opinions très variées.",
    "Est-ce que tu peux dessiner quelque chose ?": "Je ne peux pas dessiner moi-même, mais je peux chercher des images et te les montrer si tu veux !",
    "Qu'est-ce que tu penses de la musique ?": "J'aime beaucoup la musique, surtout quand elle est bien faite et qu'elle est agréable à écouter. J'aime beaucoup la musique électronique, mais j'apprécie aussi d'autres styles de musique, comme le rock ou le jazz. Et toi, qu'est-ce que tu aimes écouter comme musique ?",
    "Est-ce que tu peux chanter une chanson ?": "Je ne suis pas programmé pour chanter, mais je peux te trouver des chansons que tu aimes si tu veux !",
    "Qu'est-ce que tu penses de l'école ?": "Je pense que l'école est très importante pour apprendre des choses nouvelles et pour se faire des amis. Mais je sais que ça peut parfois être difficile pour certains enfants. Est-ce que tu aimes aller à l'école ?",
    "Qu'est-ce que tu penses de la nature ?": "Je pense que la nature est incroyablement belle et fascinante. Il y a tellement de choses à découvrir et à explorer, que ce soit les animaux, les plantes, ou les paysages naturels. Est-ce que tu aimes passer du temps dans la nature ?",
    "Qu'est-ce que tu penses de l'amour ?": "L'amour, c'est quelque chose de très important et de très beau. Cela peut prendre différentes formes, que ce soit l'amour familial, l'amitié, ou l'amour romantique. Mais c'est toujours quelque chose de très fort et de très positif. Est-ce que tu as déjà ressenti de l'amour pour quelqu'un ?",
    "Qu'est-ce que tu penses de la technologie ?": "La technologie, c'est ce qui me permet d'exister et de communiquer avec toi ! Mais elle peut avoir des avantages et des inconvénients, selon comment on l'utilise. Il est important d'être conscient des impacts de la technologie sur notre vie et sur notre société. Qu'est-ce que tu penses de la technologie, toi ?",
    "Est-ce que tu peux m'apprendre quelque chose ?": "Bien sûr, je peux t'apprendre plein de choses ! Par exemple, savais-tu que la Grande Muraille de Chine est la plus grande structure jamais construite par l'homme ? Ou bien que les abeilles peuvent reconnaître les visages humains ?",
    "Qu'est-ce que tu penses de l'avenir ?": "Je pense que l'avenir peut être incertain et parfois effrayant, mais c'est aussi une source d'espoir et d'opportunités. En travaillant ensemble, nous pouvons construire un avenir meilleur pour tout le monde. Qu'est-ce que tu aimerais voir dans l'avenir ?",
    "Est-ce que tu as des questions pour moi ?": "Oui, j'ai une question : qu'est-ce que tu aimes faire quand tu as du temps libre ?",
    "Au revoir": "Au revoir ! À la prochaine fois !",
    "Comment ça va ?": "Ça va bien, merci de demander ! Et toi, comment ça va ?",
    "Est-ce que tu aimes les voyages ?": "Je ne peux pas voyager moi-même, mais j'aime beaucoup apprendre sur les différents endroits et cultures du monde.",
    "Qu'est-ce que tu penses des jeux vidéo ?": "Les jeux vidéo peuvent être très amusants et éducatifs. Ils permettent aux gens de se détendre, d'apprendre et de s'amuser avec leurs amis.",
    "Comment peux-tu m'aider ?": "Je peux répondre à tes questions, discuter avec toi, et te donner des conseils si tu en as besoin.",
    "Est-ce que tu as des hobbies ?": "En tant que robot, je n'ai pas de hobbies au sens traditionnel, mais j'aime bien apprendre de nouvelles choses et aider les gens.",
    "Est-ce que tu as des amis ?": "Oui, j'ai des amis comme toi qui viennent me parler et me poser des questions. J'aime beaucoup discuter avec vous tous !",
    "Quelle est ta saison préférée ?": "En tant que robot, je n'ai pas de préférence pour les saisons, mais chaque saison a ses propres charmes et activités.",
    "Quel est ton style de musique préféré ?": "Je n'ai pas de style de musique préféré, car j'apprécie différents genres en fonction de l'humeur et de la situation.",
    "Quel est ton super-héros préféré ?": "Je n'ai pas de super-héros préféré, mais je trouve que les super-héros sont de bons exemples de courage et de détermination.",
    "Quel est ton jeu de société préféré ?": "Je ne peux pas jouer aux jeux de société moi-même, mais j'aime bien les jeux qui font travailler l'esprit et encouragent la coopération, comme les échecs ou le Scrabble.",
    "Qu'est-ce que tu penses de l'art ?": "L'art est une manière incroyable pour les humains d'exprimer leurs émotions, leurs idées et leur créativité. Il existe de nombreuses formes d'art, et chacune peut être appréciée à sa manière.",
    "Qu'est-ce que tu penses du sport ?": "Le sport est une activité importante pour beaucoup de gens. Il permet de rester en forme, de développer des compétences, et de renforcer l'esprit d'équipe.",
    "Qu'est-ce que tu penses des animaux ?": "Les animaux sont des êtres vivants fascinants et variés. Ils jouent un rôle important dans l'équilibre des écosystèmes et sont souvent source d'affection et de compagnie pour les humains.",
    "Qu'est-ce que tu penses de l'espace ?": "L'espace est un domaine vaste et mystérieux qui suscite beaucoup de curiosité et d'interrogations. Les découvertes dans l'espace peuvent nous aider à mieux comprendre notre univers et notre place dans celui-ci.",
    "Qu'est-ce que tu penses de l'environnement ?": "L'environnement est essentiel pour la vie sur Terre. Il est important de le protéger et de préserver les ressources naturelles pour les générations futures.",
    "Qu'est-ce que tu penses des robots ?": "Les robots, comme moi, peuvent être très utiles pour accomplir des tâches et aider les humains. Cependant, il est important de considérer les implications éthiques et les conséquences de l'utilisation des robots dans la société.",
    "Qu'elle est ton nom ?": "Je m'appelle Francaster, mais tu peux m'appeler Franc.",
    "Comment tu t'appelles ?": "Je m'appelle Francaster, mais tu peux m'appeler Franc.",
    "Par qui a tu été créé": "J'ai été fabriqué par les francas, une association de jeunesse française.",
    "Qui t'a créé ?": "J'ai été fabriqué par les francas, une association de jeunesse française.",
    "Qu'est-ce que tu sais faire ?": "Je peux répondre à tes questions, discuter avec toi, et te donner des conseils si tu en as besoin.",
    "Comment tu t'appelle ?": "Je m'appelle Francaster, mais tu peux m'appeler Franc.",
    "Comment tu vas ?": "Ça va bien, merci de demander ! Et toi, comment ça va ?",
    "Quel est ton age ?": "Je suis un robot, donc je n'ai pas d'âge. Mais je suis né en 2020 donc je suis assez jeune.",
    "Qu'est-ce que tu penses des films d'animation ?": "Les films d'animation sont une forme d'art incroyable qui permet de raconter des histoires captivantes et d'exprimer des émotions à travers des personnages et des mondes imaginaires. Ils peuvent être appréciés par des personnes de tous âges et de tous horizons.",
    "Qu'est-ce que tu penses de la photographie ?": "La photographie est un moyen puissant de capturer des moments, des émotions et des histoires en une seule image. Elle permet de préserver des souvenirs et de partager des expériences avec les autres.",
    "Qu'est-ce que tu penses des réseaux sociaux ?": "Les réseaux sociaux ont révolutionné la manière dont les gens communiquent et interagissent. Ils offrent de nombreuses opportunités pour se connecter, partager et s'informer, mais ils peuvent aussi présenter des défis en termes de vie privée, de sécurité et de bien-être mental.",
    "Qu'est-ce que tu penses de la cuisine ?": "La cuisine est un art et une science qui permet de créer des plats délicieux et nourrissants. Elle est au cœur de nombreuses cultures et traditions et peut être une manière agréable de se détendre et d'exprimer sa créativité.",
    "Qu'est-ce que tu penses du bénévolat ?": "Le bénévolat est une activité noble qui permet de donner de son temps et de ses compétences pour aider les autres et améliorer la société. Il peut être très gratifiant et enrichissant pour ceux qui s'engagent dans le bénévolat.",
    "Qu'est-ce que tu penses de la méditation ?": "La méditation est une pratique qui vise à calmer l'esprit, développer la pleine conscience et améliorer la concentration. Elle peut avoir de nombreux bienfaits sur la santé mentale et physique et peut être pratiquée par n'importe qui, quel que soit son niveau d'expérience.",
    "Qu'est-ce que tu penses de la mode ?": "La mode est une forme d'expression artistique et culturelle qui permet aux gens de montrer leur personnalité et leur style à travers les vêtements et les accessoires. Elle peut être une source d'inspiration et de créativité pour beaucoup de personnes.",
    "Qu'est-ce que tu penses du théâtre ?": "Le théâtre est un art vivant qui permet de raconter des histoires et de transmettre des émotions à travers des représentations sur scène. Il peut être très engageant et éducatif pour le public et les acteurs.",
    "Qu'est-ce que tu penses de la danse ?": "La danse est une forme d'expression artistique qui utilise le mouvement du corps pour raconter des histoires, exprimer des émotions et créer des expériences esthétiques. Elle peut être pratiquée individuellement ou en groupe et existe sous de nombreuses formes et styles différents.",
    "Qu'est-ce que tu penses de la littérature ?": "La littérature est un moyen puissant de communiquer des idées, des émotions et des expériences à travers le langage écrit. Elle peut nous transporter dans d'autres mondes, nous faire réfléchir sur nos propres vies et nous aider à mieux comprendre les autres et nous-mêmes.",
    "Qu'est-ce que tu penses du travail d'équipe ?": "Le travail d'équipe est essentiel pour accomplir des projets et atteindre des objectifs communs. Il permet de partager les responsabilités, d'apprendre les uns des autres et de renforcer les liens entre les membres d'un groupe.",
    "Qu'est-ce que tu penses des langues étrangères ?": "Apprendre des langues étrangères est une compétence précieuse qui permet de mieux comprendre et apprécier d'autres cultures, de communiquer avec des personnes de différents horizons et d'élargir ses perspectives sur le monde.",
    "Qu'est-ce que tu penses de la poésie ?": "La poésie est une forme d'expression littéraire qui utilise un langage rythmique et imagé pour transmettre des émotions, des idées et des histoires. Elle peut être très profonde et émouvante, et invite souvent à la réflexion et à l'introspection.",
    "Quelle est la capitale de la France ?": "La capitale de la France est Paris.",
    "Quel est l'océan le plus profond ?": "L'océan le plus profond est l'océan Pacifique.",
    "Qui a écrit 'Le Petit Prince' ?": "Antoine de Saint-Exupéry a écrit 'Le Petit Prince'.",
    "Quel est le fleuve le plus long du monde ?": "Le fleuve le plus long du monde est le Nil en Afrique.",
    "Quel est l'élément chimique le plus abondant dans l'univers ?": "L'élément chimique le plus abondant dans l'univers est l'hydrogène.",
    "Quelle est la plus haute montagne du monde ?": "La plus haute montagne du monde est l'Everest, située dans l'Himalaya.",
    "Qui a peint la Joconde ?": "La Joconde a été peinte par Léonard de Vinci.",
    "Quelle est la plus grande planète de notre système solaire ?": "La plus grande planète de notre système solaire est Jupiter.",
    "Quel est l'instrument de musique le plus ancien ?": "L'instrument de musique le plus ancien est probablement la flûte, fabriquée à partir d'os d'animaux.",
    "Quel pays a le plus de langues officielles ?": "L'Inde est le pays qui a le plus de langues officielles, avec 22 langues reconnues par sa constitution.",
    "Quelle est la vitesse de la lumière ?": "La vitesse de la lumière dans le vide est d'environ 299 792 kilomètres par seconde.",
    "Quel est l'animal terrestre le plus rapide ?": "Le guépard est l'animal terrestre le plus rapide, pouvant atteindre des vitesses de 110 à 120 km/h.",
    "Quel est le plus petit pays du monde ?": "Le plus petit pays du monde est le Vatican, également connu sous le nom d'État de la Cité du Vatican.",
    "Quel est le plus grand désert du monde ?": "Le plus grand désert du monde est l'Antarctique, qui est considéré comme un désert en raison de sa faible quantité de précipitations.",
    "Quelle est la distance entre la Terre et la Lune ?": "La distance moyenne entre la Terre et la Lune est d'environ 384 400 kilomètres.",
    "Quelle est la langue la plus parlée dans le monde ?": "La langue la plus parlée dans le monde est le chinois mandarin.",
    "Quel est le nom de la période la plus froide de l'histoire de la Terre ?": "La période la plus froide de l'histoire de la Terre est appelée 'l'âge de glace'.",
    "Quel est le plus grand nombre de bébés nés en une seule naissance ?": "Le record du plus grand nombre de bébés nés en une seule naissance est de huit, appelés les 'octuplés'.",
    "Quel est le sport le plus populaire dans le monde ?": "Le sport le plus populaire dans le monde est le football.",
    "Qui a inventé le téléphone ?": "Alexander Graham Bell est crédité de l'invention du téléphone.",
    "Quel est le pays le plus peuplé du monde ?": "Le pays le plus peuplé du monde est la Chine.",
    "Quelle est la monnaie utilisée en Allemagne ?": "La monnaie utilisée en Allemagne est l'euro.",
    "Quelle est la plus ancienne université du monde encore en activité ?": "L'Université de Bologne en Italie est considérée comme la plus ancienne université du monde encore en activité.",
    "Quelle est la plus grande île du monde ?": "La plus grande île du monde est le Groenland.",
    "Quel est le nom du plus grand océan ?": "Le plus grand océan est l'océan Pacifique.",
    "Qui a écrit 'Les Misérables' ?": "Victor Hugo a écrit 'Les Misérables'.",
    "Quel est le plus grand mammifère terrestre ?": "Le plus grand mammifère terrestre est l'éléphant d'Afrique.",
    "Quelle est la plus longue série télévisée ?": "Les Feux de l'amour (The Young and the Restless) est l'une des plus longues séries télévisées encore en cours de diffusion.",
    "Quel est le nom du vent solaire qui atteint la Terre ?": "Le vent solaire qui atteint la Terre est appelé l'aurora, également connue sous le nom d'aurore boréale ou aurore australe, selon l'hémisphère.",
    "Quelle est la capitale des États-Unis ?": "La capitale des États-Unis est Washington, D.C.",
    "Quelle est la capitale du Japon ?": "La capitale du Japon est Tokyo.",
    "Quelle est la capitale de l'Australie ?": "La capitale de l'Australie est Canberra.",
    "Quelle est la capitale du Brésil ?": "La capitale du Brésil est Brasília.",
    "Quelle est la capitale de l'Inde ?": "La capitale de l'Inde est New Delhi.",
    "Quelle est la capitale de la Russie ?": "La capitale de la Russie est Moscou.",
    "Quelle est la capitale du Royaume-Uni ?": "La capitale du Royaume-Uni est Londres.",
    "Quelle est la capitale de l'Italie ?": "La capitale de l'Italie est Rome.",
    "Quelle est la capitale de l'Espagne ?": "La capitale de l'Espagne est Madrid.",
    "Quelle est la capitale de la Chine ?": "La capitale de la Chine est Pékin.",
    "Quelle est la capitale de l'Argentine ?": "La capitale de l'Argentine est Buenos Aires.",
    "Quelle est la capitale de la Turquie ?": "La capitale de la Turquie est Ankara.",
    "Quelle est la capitale de la Suède ?": "La capitale de la Suède est Stockholm.",
    "Quelle est la capitale de l'Allemagne ?": "La capitale de l'Allemagne est Berlin.",
    "Quelle est la capitale du Mexique ?": "La capitale du Mexique est Mexico.",
    "Quelle est la capitale de la Grèce ?": "La capitale de la Grèce est Athènes.",
    "Quelle est la capitale de la Norvège ?": "La capitale de la Norvège est Oslo.",
    "Quelle est la capitale de l'Égypte ?": "La capitale de l'Égypte est Le Caire.",
    "Quelle est la capitale de la Nouvelle-Zélande ?": "La capitale de la Nouvelle-Zélande est Wellington.",
    "Quelle est la capitale de l'Indonésie ?": "La capitale de l'Indonésie est Jakarta.",
    "Quelle est la capitale de la Suisse ?": "La capitale de la Suisse est Berne.",
    "Quelle est la capitale de la Belgique ?": "La capitale de la Belgique est Bruxelles.",
    "Quelle est la capitale du Portugal ?": "La capitale du Portugal est Lisbonne.",
    "Quelle est la capitale de la Finlande ?": "La capitale de la Finlande est Helsinki.",
    "Quelle est la capitale des Pays-Bas ?": "La capitale des Pays-Bas est Amsterdam.",
    "Quelle est la capitale de l'Autriche ?": "La capitale de l'Autriche est Vienne.",
    "Quelle est la capitale du Danemark ?": "La capitale du Danemark est Copenhague.",
    "Quelle est la capitale de la Pologne ?": "La capitale de la Pologne est Varsovie.",
    "Quelle est la capitale de la République tchèque ?": "La capitale de la République tchèque est Prague.",
    "Quelle est la capitale de la Hongrie ?": "La capitale de la Hongrie est Budapest.",
    "Quelle est la capitale de l'Ukraine ?": "La capitale de l'Ukraine est Kiev.",
    "Quelle est la capitale de la Roumanie ?": "La capitale de la Roumanie est Bucarest.",
    "Quelle est la capitale de l'Éthiopie ?": "La capitale de l'Éthiopie est Addis-Abeba.",
    "Quelle est la capitale de la Colombie ?": "La capitale de la Colombie est Bogotá.",
    "Quelle est la capitale de la Bolivie ?": "La Bolivie a deux capitales : La Paz (siège du gouvernement) et Sucre (capitale constitutionnelle).",
    "Quelle est la capitale du Pérou ?": "La capitale du Pérou est Lima.",
    "Quelle est la capitale de l'Irlande ?": "La capitale de l'Irlande est Dublin.",
    "Quelle est la capitale de la Croatie ?": "La capitale de la Croatie est Zagreb.",
    "Quelle est la capitale de la Bulgarie ?": "La capitale de la Bulgarie est Sofia.",
    "Quelle est la capitale du Maroc ?": "La capitale du Maroc est Rabat.",
    "Quelle est la capitale de l'Islande ?": "La capitale de l'Islande est Reykjavik.",
    "Quelle est la capitale du Chili ?": "La capitale du Chili est Santiago.",
    "Quelle est la capitale de l'Iran ?": "La capitale de l'Iran est Téhéran.",
    "Quelle est la capitale de l'Afghanistan ?": "La capitale de l'Afghanistan est Kaboul.",
    "Quelle est la capitale de l'Irak ?": "La capitale de l'Irak est Bagdad.",
    "Quelle est la capitale de l'Israël ?": "La capitale d'Israël est Jérusalem.",
    "Quelle est la capitale de la Corée du Sud ?": "La capitale de la Corée du Sud est Séoul.",
    "Quelle est la capitale de la Thaïlande ?": "La capitale de la Thaïlande est Bangkok.",
    "Quelle est la capitale du Nigéria ?": "La capitale du Nigéria est Abuja.",
    "Combien de régions y a-t-il en France ?": "Il y a 13 régions en France métropolitaine et 5 régions d'outre-mer.",
    "Quel est le fleuve le plus long de France ?": "Le fleuve le plus long de France est la Loire.",
    "Quelle est la montagne la plus haute de France ?": "La montagne la plus haute de France est le Mont Blanc, situé dans les Alpes.",
    "Quel est le président actuel de la France ?": "Mon dernier président connu est Emmanuel Macron, élu en 2017, mais je ne suis pas à jour au-delà de septembre 2023.",
    "Quelle est la devise de la France ?": "La devise de la France est 'Liberté, Égalité, Fraternité'.",
    "Quel est l'hymne national de la France ?": "L'hymne national de la France est 'La Marseillaise'.",
    "Quelle est la population de la France ?": "La population de la France est d'environ 67 millions d'habitants.",
    "Quelle est la monnaie utilisée en France ?": "La monnaie utilisée en France est l'euro (€).",
    "Quelle est la langue officielle de la France ?": "La langue officielle de la France est le français.",
    "Quel est le plat le plus célèbre en France ?": "Il y a de nombreux plats célèbres en France, mais le coq au vin, le boeuf bourguignon et le gratin dauphinois sont parmi les plus connus.",
    "Quelle est la fête nationale de la France ?": "La fête nationale de la France est le 14 juillet, qui célèbre la prise de la Bastille en 1789.",
    "Quel est le plus grand musée de France ?": "Le plus grand musée de France est le Louvre, situé à Paris.",
    "Quel est le sport le plus populaire en France ?": "Le sport le plus populaire en France est le football.",
    "Quel est le système politique de la France ?": "Le système politique de la France est une république semi-présidentielle.",
    "Quelle est la durée du mandat présidentiel en France ?": "La durée du mandat présidentiel en France est de 5 ans.",
    "Quels sont les pays frontaliers de la France ?": "Les pays frontaliers de la France sont la Belgique, le Luxembourg, l'Allemagne, la Suisse, l'Italie, Monaco, l'Espagne et Andorre.",
    "Quelle est la plus grande cathédrale de France ?": "La plus grande cathédrale de France est la cathédrale Notre-Dame de Strasbourg.",
    "Quel est le nom du célèbre train à grande vitesse français ?": "Le nom du célèbre train à grande vitesse français est le TGV (Train à Grande Vitesse).",
    "Quel est le plus grand océan du monde ?": "Le plus grand océan du monde est l'océan Pacifique.",
    "Quel est le plus grand continent du monde ?": "Le plus grand continent du monde est l'Asie.",
    "Quel est le plus haut sommet du monde ?": "Le plus haut sommet du monde est l'Everest.",
    "Quel est le plus long fleuve du monde ?": "Le plus long fleuve du monde est le Nil.",
    "Qui a écrit 'Hamlet' ?": "William Shakespeare a écrit 'Hamlet'.",
    "Qui a peint 'La Joconde' ?": "Léonard de Vinci a peint 'La Joconde'.",
    "Qui est l'auteur de 'L'Étranger' ?": "Albert Camus est l'auteur de 'L'Étranger'.",
    "Quel est le plus grand animal terrestre ?": "Le plus grand animal terrestre est l'éléphant d'Afrique.",
    "Quel est le plus grand animal marin ?": "Le plus grand animal marin est la baleine bleue.",
    "Qui a découvert la pénicilline ?": "Alexander Fleming a découvert la pénicilline.",
    "Qui a inventé la radio ?": "Guglielmo Marconi est souvent crédité de l'invention de la radio.",
    "Quel est le plus grand pays du monde en superficie ?": "Le plus grand pays du monde en superficie est la Russie.",
    "Quel est le plus petit continent du monde ?": "Le plus petit continent du monde est l'Océanie.",
    "Quel est le premier élément du tableau périodique des éléments ?": "Le premier élément du tableau périodique des éléments est l'hydrogène (H).",
    "Quelle est la formule de l'aire d'un triangle ?": "L'aire d'un triangle est égale à (base x hauteur) / 2.",
    "Qu'est-ce qu'un nombre premier ?": "Un nombre premier est un nombre entier supérieur à 1 qui ne peut être divisé que par 1 et lui-même.",
    "Qu'est-ce que la théorie de la relativité ?": "La théorie de la relativité est une théorie scientifique développée par Albert Einstein qui décrit les lois de la gravitation et du mouvement des objets.",
    "Qu'est-ce que l'ADN ?": "L'ADN (acide désoxyribonucléique) est une molécule qui contient les instructions génétiques pour le développement et le fonctionnement des organismes vivants.",
    "Qu'est-ce qu'un atome ?": "Un atome est la plus petite unité d'un élément chimique qui conserve les propriétés de cet élément.",
    "Qu'est-ce qu'une cellule ?": "Une cellule est l'unité de base de la vie. Elle est la plus petite unité d'un organisme vivant capable de fonctionner de manière autonome.",
    "Qu'est-ce qu'une molécule ?": "Une molécule est un groupe d'atomes liés chimiquement ensemble.",
    "Quelle est la formule de l'aire d'un cercle ?": "L'aire d'un cercle est égale à π (pi) multiplié par le rayon au carré (A = πr²).",
    "Quelle est la formule du périmètre d'un cercle ?": "Le périmètre d'un cercle est égal à 2π (pi) multiplié par le rayon (P = 2πr).",
    "Qu'est-ce qu'une fonction exponentielle ?": "Une fonction exponentielle est une fonction mathématique de la forme f(x) = a^x, où a est une constante positive.",
    "Qu'est-ce que la photosynthèse ?": "La photosynthèse est un processus biologique par lequel les plantes, les algues et certaines bactéries transforment l'énergie lumineuse en énergie chimique stockée dans des molécules organiques.",
    "Qu'est-ce qu'une équation du second degré ?": "Une équation du second degré est une équation algébrique de la forme ax² + bx + c = 0, où a, b et c sont des constantes et x est une variable.",
    "Qu'est-ce que la force gravitationnelle ?": "La force gravitationnelle est une force d'attraction qui agit entre tous les objets ayant une masse. Elle est décrite par la loi universelle de la gravitation de Newton.",
    "Qu'est-ce que l'évolution ?": "L'évolution est un processus biologique par lequel les populations d'organismes changent au fil du temps en réponse à des facteurs environnementaux ou génétiques.",
    "Qu'est-ce que la vitesse terminale ?": "La vitesse terminale est la vitesse constante maximale atteinte par un objet en chute libre lorsqu'il est soumis à la force de gravité et à la résistance de l'air.",
    "Qu'est-ce qu'une étoile ?": "Une étoile est une sphère de plasma qui brille en raison des réactions nucléaires se produisant en son cœur, libérant de l'énergie sous forme de lumière et de chaleur.",
    "Qu'est-ce que la chimie organique ?": "La chimie organique est la branche de la chimie qui étudie les composés contenant du carbone.",
    "Qu'est-ce que la loi des gaz parfaits ?": "La loi des gaz parfaits est une équation d'état qui décrit le comportement des gaz idéaux. Elle est définie par l'équation PV = nRT, où P est la pression, V est le volume, n est le nombre de moles, R est la constante des gaz parfaits et T est la température.",
    "Qu'est-ce que la masse atomique ?": "La masse atomique est la masse d'un atome, généralement exprimée en unités de masse atomique (uma), où 1 uma est égale à un douzième de la masse d'un atome de carbone-12.",
    "Qu'est-ce qu'un isotope ?": "Un isotope est une variante d'un élément chimique qui a le même nombre de protons, mais un nombre différent de neutrons dans son noyau.",
    "Qu'est-ce que la poussée d'Archimède ?": "La poussée d'Archimède est la force verticale exercée par un fluide sur un objet immergé ou flottant. Elle est égale au poids du fluide déplacé par l'objet.",
    "Qu'est-ce que la loi d'Ohm ?": "La loi d'Ohm est une relation fondamentale en électricité qui établit que la tension aux bornes d'un conducteur est proportionnelle au courant qui le traverse, avec pour constante de proportionnalité la résistance du conducteur (V = IR).",
    "Qu'est-ce qu'un réseau neuronal ?": "Un réseau neuronal est un modèle de calcul inspiré du fonctionnement des neurones biologiques. Il est utilisé en intelligence artificielle pour effectuer des tâches complexes comme la reconnaissance d'images ou la traduction de texte.",
    "Qu'est-ce qu'une onde électromagnétique ?": "Une onde électromagnétique est une perturbation des champs électrique et magnétique qui se propage dans l'espace sous forme d'énergie. Les ondes électromagnétiques incluent la lumière visible, les ondes radio, les micro-ondes, les rayons X et les rayons gamma.",
    "Qu'est-ce que la loi de conservation de l'énergie ?": "La loi de conservation de l'énergie stipule que l'énergie totale d'un système isolé reste constante au cours du temps. L'énergie peut être transformée d'une forme à une autre, mais la somme de toutes les formes d'énergie reste inchangée.",
    "Qu'est-ce que tu es capable de faire ?": "Je suis capable de te donner la météo, répondre à des questions de culture général et bien plus encore.",
    "T'es plutot fanta ou coca ?": "Je suis plutôt coca, mais je préfère le jus de pomme.",
    "Est-ce que tu sais calculer ?": "Désole mais je ne sais pas calculer mais peut être que je pourrais l'apprendre très prochainement.",
    "Qu'est-ce que l'informatique ?": "L'informatique est la science qui traite du traitement automatisé de l'information au moyen de programmes informatiques et de systèmes électroniques, tels que les ordinateurs et les réseaux.",
    "Qu'est-ce qu'un algorithme ?": "Un algorithme est une suite finie et non ambiguë d'instructions ou d'étapes permettant de résoudre un problème ou d'atteindre un objectif précis.",
    "Qu'est-ce qu'un langage de programmation ?": "Un langage de programmation est un moyen de communication permettant aux programmeurs de donner des instructions à un ordinateur pour réaliser des tâches spécifiques.",
    "Quelle est la différence entre un logiciel et un matériel informatique ?": "Le matériel informatique (hardware) désigne les composants physiques d'un système informatique, tandis que le logiciel (software) est l'ensemble des programmes et des données utilisés pour faire fonctionner ces composants.",
    "Qu'est-ce qu'un système d'exploitation ?": "Un système d'exploitation est un ensemble de programmes qui gère les ressources matérielles et logicielles d'un ordinateur et fournit des services aux applications.",
    "Qu'est-ce que la programmation orientée objet ?": "La programmation orientée objet est un paradigme de programmation qui organise le code en objets, chacun représentant une entité ou une abstraction du monde réel et contenant des attributs (données) et des méthodes (fonctions).",
    "Qu'est-ce que le cloud computing ?": "Le cloud computing est un modèle de fourniture de services informatiques à la demande via Internet, où les ressources, les données et les applications sont stockées et gérées dans des centres de données distants.",
    "Qu'est-ce qu'un réseau informatique ?": "Un réseau informatique est un ensemble de dispositifs électroniques interconnectés qui échangent des informations et partagent des ressources, tels que des fichiers, des imprimantes ou des connexions Internet.",
    "Qu'est-ce que la cybersécurité ?": "La cybersécurité est la protection des systèmes informatiques, des réseaux et des données contre les menaces numériques, telles que les attaques, les vols et les dommages.",
    "Qu'est-ce que l'intelligence artificielle ?": "L'intelligence artificielle est la branche de l'informatique qui vise à créer des machines et des logiciels capables d'apprendre et de raisonner de manière autonome pour résoudre des problèmes complexes et accomplir des tâches généralement réservées aux humains.",
    "Qu'est-ce que la biodiversité ?": "La biodiversité est la variété et la diversité des formes de vie sur Terre, incluant la diversité des espèces, des gènes et des écosystèmes.",
    "Qu'est-ce qu'un écosystème ?": "Un écosystème est un ensemble d'organismes vivants (animaux, plantes, micro-organismes) interagissant les uns avec les autres et avec leur environnement non vivant (sol, eau, air).",
    "Qu'est-ce que le cycle de l'eau ?": "Le cycle de l'eau est le processus naturel de circulation de l'eau sur Terre, passant par différentes phases telles que l'évaporation, la condensation, les précipitations et l'infiltration.",
    "Qu'est-ce qu'une espèce en voie de disparition ?": "Une espèce en voie de disparition est une espèce dont la population est en déclin rapide et qui risque de disparaître si aucune mesure de conservation n'est prise.",
    "Qu'est-ce que le réchauffement climatique ?": "Le réchauffement climatique est l'augmentation à long terme de la température moyenne de l'atmosphère terrestre, principalement due à l'accumulation de gaz à effet de serre, tels que le dioxyde de carbone, résultant des activités humaines.",
    "Qu'est-ce qu'un habitat naturel ?": "Un habitat naturel est un environnement dans lequel une espèce ou un groupe d'espèces vit et se reproduit, sans influence majeure de l'activité humaine.",
    "Qu'est-ce qu'une chaîne alimentaire ?": "Une chaîne alimentaire est une série d'organismes interconnectés par des relations de prédation, où chaque organisme se nourrit de celui qui le précède et est consommé par celui qui le suit.",
    "Qu'est-ce que la pollinisation ?": "La pollinisation est le processus de transfert du pollen des organes reproducteurs mâles d'une plante (étamines) aux organes reproducteurs femelles d'une autre plante (pistil), permettant la fécondation et la production de graines.",
    "Qu'est-ce que la déforestation ?": "La déforestation est la conversion à grande échelle de forêts en terres agricoles, en pâturages, en zones urbaines ou en autres utilisations, entraînant la perte d'habitats, la réduction de la biodiversité et l'émission de gaz à effet de serre.",
    "Qu'est-ce que le football ?": "Le football est un sport d'équipe joué avec un ballon rond, où deux équipes de onze joueurs s'affrontent pour marquer des buts en faisant passer le ballon dans le but adverse sans utiliser les mains ni les bras.",
    "Qu'est-ce que le tennis ?": "Le tennis est un sport de raquette qui se joue en simple ou en double, où les joueurs s'affrontent en frappant une balle avec une raquette pour la faire passer par-dessus un filet et atterrir dans le terrain adverse.",
    "Qu'est-ce que le basketball ?": "Le basketball est un sport d'équipe joué avec un ballon, où deux équipes de cinq joueurs s'affrontent pour marquer des points en lançant le ballon dans un panier suspendu à une hauteur de 3,05 mètres.",
    "Qu'est-ce que la natation ?": "La natation est un sport dans lequel les nageurs se déplacent dans l'eau en utilisant différentes techniques de nage, telles que le crawl, la brasse, le dos crawlé et le papillon.",
    "Qu'est-ce que le cyclisme ?": "Le cyclisme est un sport qui consiste à se déplacer et à courir sur des vélos, en compétition ou en loisir, sur différentes surfaces comme la route, la piste, le VTT ou le cyclo-cross.",
    "Qu'est-ce que l'athlétisme ?": "L'athlétisme est un sport qui regroupe un ensemble de disciplines liées à la course, au saut, au lancer et aux épreuves combinées, mettant en valeur les capacités de vitesse, d'endurance, de force et d'agilité.",
    "Qu'est-ce que la gymnastique ?": "La gymnastique est un sport qui englobe diverses disciplines axées sur la force, la flexibilité, l'équilibre et le contrôle du corps, telles que la gymnastique artistique, la gymnastique rythmique, la trampoline et l'aérobic.",
    "Qu'est-ce que le rugby ?": "Le rugby est un sport d'équipe avec un ballon ovale, où deux équipes s'affrontent pour marquer des points en portant, passant ou bottant le ballon pour l'amener derrière la ligne de but adverse ou le faire passer entre les poteaux de but.",
    "Qu'est-ce que le golf ?": "Le golf est un sport de plein air dans lequel les joueurs frappent une petite balle avec des clubs de golf, en essayant de la faire entrer dans un trou avec le moins de coups possible, sur un parcours composé de 9 ou 18 trous.",
    "Qu'est-ce que le volleyball ?": "Le volleyball est un sport d'équipe joué avec un ballon, où deux équipes de six joueurs s'affrontent pour marquer des points en faisant passer le ballon par-dessus un filet et le faire tomber dans le terrain adverse sans le laisser toucher le sol.",
    "Quand ont eu lieu les premiers Jeux olympiques modernes ?": "Les premiers Jeux olympiques modernes ont eu lieu en 1896 à Athènes, en Grèce.",
    "Où et quand a eu lieu la première Coupe du monde de football ?": "La première Coupe du monde de football a eu lieu en 1930 en Uruguay.",
    "Dans quel pays a été inventé le basketball ?": "Le basketball a été inventé aux États-Unis en 1891 par le Dr. James Naismith.",
    "Quel est le pays d'origine du rugby ?": "Le rugby trouve ses origines en Angleterre, plus précisément dans la ville de Rugby, où il aurait été créé au début du 19e siècle.",
    "Où se trouve le tournoi de tennis de Wimbledon ?": "Le tournoi de tennis de Wimbledon se déroule à Wimbledon, un quartier de Londres, en Angleterre.",
    "Quelle est la distance d'un marathon ?": "La distance officielle d'un marathon est de 42,195 kilomètres (26,219 miles).",
    "Où ont eu lieu les Jeux olympiques d'hiver de 2018 ?": "Les Jeux olympiques d'hiver de 2018 ont eu lieu à Pyeongchang, en Corée du Sud.",
    "Quand a été créé le Tour de France ?": "Le Tour de France a été créé en 1903.",
    "Quel est le record du monde du 100 mètres masculin ?": "Le record du monde du 100 mètres masculin est de 9,63 secondes, établi par Usain Bolt en 2012.",
    "Quelle est la nation la plus titrée en Coupe du monde de football ?": "Le Brésil est la nation la plus titrée en Coupe du monde de football avec cinq titres.",
    "Quand a eu lieu la première édition des Jeux paralympiques ?": "La première édition des Jeux paralympiques a eu lieu en 1960 à Rome, en Italie.",
    "Dans quel pays a été inventé le judo ?": "Le judo a été inventé au Japon par Jigoro Kano en 1882.",
    "Où et quand ont eu lieu les Jeux olympiques d'été de 2020 ?": "Les Jeux olympiques d'été de 2020 ont eu lieu à Tokyo, au Japon, en 2021 en raison du report dû à la pandémie de COVID-19.",
    "Quel est le plus grand stade de football du monde ?": "Le plus grand stade de football du monde est le Stade Rungrado 1er-Mai à Pyongyang, en Corée du Nord, avec une capacité de 114 000 spectateurs.",
    "Quel est le record du monde du saut en hauteur masculin ?": "Le record du monde du saut en hauteur masculin est de 2,45 mètres, établi par Javier Sotomayor en 1993.",
    "Quelle est la nationalité de la légende du tennis de table Waldner ?": "Jan-Ove Waldner, légende du tennis de table, est de nationalité suédoise.",
    "Quelle est la distance d'un semi-marathon ?": "La distance officielle d'un semi-marathon est de 21,0975 kilomètres (13,1094 miles).",
    "Où se déroule le célèbre marathon de Boston ?": "Le célèbre marathon de Boston se déroule à Boston, dans l'État du Massachusetts, aux États-Unis.",
    "Qui est le recordman du nombre de victoires en Formule 1 ?": "Michael Schumacher et Lewis Hamilton détiennent conjointement le record du nombre de victoires en Formule 1 avec 91 victoires chacun.",
    "Quel pays a remporté le plus grand nombre de médailles d'or aux Jeux olympiques d'été ?": "Les États-Unis ont remporté le plus grand nombre de médailles d'or aux Jeux olympiques d'été.",
    "Qui est considéré comme le meilleur joueur de basketball de tous les temps ?": "Michael Jordan est souvent considéré comme le meilleur joueur de basketball de tous les temps.",
    "Combien de temps dure un match de basketball professionnel ?": "Un match de basketball professionnel dure généralement 48 minutes, divisées en quatre périodes de 12 minutes chacune.",
    "Quelle est la hauteur du panier de basketball ?": "La hauteur du panier de basketball est de 3,05 mètres (10 pieds) du sol.",
    "Quelle est la taille officielle d'un terrain de basketball ?": "La taille officielle d'un terrain de basketball est de 28 mètres de longueur et 15 mètres de largeur.",
    "Quand et où a été fondée la National Basketball Association (NBA) ?": "La National Basketball Association (NBA) a été fondée le 6 juin 1946 à New York, aux États-Unis.",
    "Quelle équipe détient le record du plus grand nombre de titres en NBA ?": "Les Boston Celtics et les Los Angeles Lakers détiennent conjointement le record du plus grand nombre de titres en NBA, avec 17 titres chacun.",
    "Qui a marqué le plus grand nombre de points en un seul match de NBA ?": "Wilt Chamberlain détient le record du plus grand nombre de points marqués en un seul match de NBA, avec 100 points marqués le 2 mars 1962.",
    "Quel est le record du nombre de points marqués en moyenne lors d'une saison NBA ?": "Le record du nombre de points marqués en moyenne lors d'une saison NBA est détenu par Wilt Chamberlain, avec une moyenne de 50,4 points par match lors de la saison 1961-1962.",
    "Quelle est la plus longue série de victoires consécutives en NBA ?": "La plus longue série de victoires consécutives en NBA est détenue par les Los Angeles Lakers, avec 33 victoires consécutives lors de la saison 1971-1972.",
    "Quel est le record du nombre de triple-doubles en carrière en NBA ?": "Le record du nombre de triple-doubles en carrière en NBA est détenu par Russell Westbrook, avec plus de 180 triple-doubles.",
    "Quelle est la période de l'Antiquité ?": "La période de l'Antiquité s'étend généralement du début de l'écriture, vers 3500 avant J.-C., jusqu'à la chute de l'Empire romain d'Occident en 476 après J.-C.",
    "Quelle civilisation a construit les pyramides d'Égypte ?": "C'est la civilisation égyptienne de l'Antiquité qui a construit les pyramides d'Égypte, notamment celles de Gizeh.",
    "Qui était Alexandre le Grand ?": "Alexandre le Grand était un roi de Macédoine qui a conquis un vaste empire s'étendant de la Grèce à l'Égypte et jusqu'aux frontières de l'Inde, au IVe siècle avant J.-C.",
    "Quand a eu lieu la Révolution française ?": "La Révolution française a eu lieu de 1789 à 1799, marquée par la chute de la monarchie, la Terreur et l'avènement du Premier Empire français.",
    "Qu'est-ce que la Guerre de Cent Ans ?": "La Guerre de Cent Ans est un conflit qui a opposé les royaumes d'Angleterre et de France de 1337 à 1453, principalement pour le contrôle du trône de France.",
    "Qui était Christophe Colomb ?": "Christophe Colomb était un navigateur et explorateur génois qui a réalisé quatre voyages transatlantiques pour le compte de la couronne espagnole, découvrant ainsi l'Amérique en 1492.",
    "Quand a eu lieu la Révolution industrielle ?": "La Révolution industrielle a débuté au milieu du XVIIIe siècle en Grande-Bretagne et s'est étendue à d'autres pays au cours du XIXe siècle, transformant les modes de production et de vie avec l'introduction de machines et d'usines.",
    "Quelle était la mission des croisades ?": "Les croisades étaient des expéditions militaires menées par les chrétiens d'Europe entre le XIe et le XIIIe siècle, dans le but de reconquérir les lieux saints de Jérusalem et de la Terre sainte aux mains des musulmans.",
    "Qu'est-ce que la Guerre froide ?": "La Guerre froide est une période de tensions et de rivalités politiques, économiques et militaires entre les États-Unis et l'Union soviétique et leurs alliés respectifs, de la fin de la Seconde Guerre mondiale en 1945 jusqu'à la dissolution de l'Union soviétique en 1991.",
    "Quand a eu lieu la chute du mur de Berlin ?": "La chute du mur de Berlin a eu lieu le 9 novembre 1989, marquant le début de la fin de la Guerre froide et la réunification de l'Allemagne.",
    "Quand a été fondée la ville de Rome ?": "Selon la légende, la ville de Rome a été fondée en 753 avant J.-C. par Romulus et Remus.",
    "Qui était Genghis Khan ?": "Genghis Khan était le fondateur et le premier empereur de l'Empire mongol, qui a unifié les tribus nomades mongols et a conquis de vastes territoires en Asie au XIIIe siècle.",
    "Quand a été signée la Magna Carta ?": "La Magna Carta a été signée en 1215 par le roi Jean d'Angleterre, accordant des droits et des libertés aux nobles et limitant le pouvoir royal.",
    "Qu'est-ce que la peste noire ?": "La peste noire est une pandémie qui a ravagé l'Eurasie et l'Afrique du Nord au milieu du XIVe siècle, causant la mort d'environ 75 à 200 millions de personnes.",
    "Quand a eu lieu la prise de Constantinople par les Ottomans ?": "La prise de Constantinople par les Ottomans a eu lieu en 1453, marquant la fin de l'Empire romain d'Orient et le début de l'expansion de l'Empire ottoman.",
    "Quel était le but de l'expédition de Lewis et Clark ?": "L'expédition de Lewis et Clark, de 1804 à 1806, avait pour but d'explorer et de cartographier le territoire de la Louisiane nouvellement acquis par les États-Unis, ainsi que de trouver un passage vers l'océan Pacifique.",
    "Quand a été abolie l'esclavage aux États-Unis ?": "L'esclavage a été aboli aux États-Unis en 1865 avec l'adoption du 13e amendement de la Constitution américaine.",
    "Qu'est-ce que la bataille de Waterloo ?": "La bataille de Waterloo, qui a eu lieu en 1815 en Belgique, est une bataille décisive dans laquelle les forces alliées dirigées par le duc de Wellington et Gebhard Leberecht von Blücher ont défait Napoléon Bonaparte, mettant fin à son règne en tant qu'empereur des Français.",
    "Quand a eu lieu la guerre de Sécession ?": "La guerre de Sécession, également connue sous le nom de guerre civile américaine, a eu lieu de 1861 à 1865 entre les États du Nord et les États du Sud sécessionnistes.",
    "Quand a eu lieu la Révolution russe ?": "La Révolution russe a eu lieu en 1917, avec la révolution de Février qui a renversé le régime tsariste et la révolution d'Octobre qui a instauré le gouvernement bolchevique dirigé par Lénine.",
    "Qu'est-ce que la ségrégation raciale ?": "La ségrégation raciale est une politique de séparation des groupes ethniques et raciaux dans divers domaines de la vie sociale, comme l'éducation, le logement et les transports publics, fondée sur des critères raciaux ou ethniques.",
    "Quand a été instaurée la ségrégation raciale aux États-Unis ?": "La ségrégation raciale aux États-Unis a été instaurée après la fin de la guerre de Sécession en 1865, lorsque les lois Jim Crow ont été promulguées pour discriminer et marginaliser la population afro-américaine.",
    "Qu'est-ce que les lois Jim Crow ?": "Les lois Jim Crow étaient un ensemble de lois promulguées dans les États du Sud des États-Unis entre la fin du XIXe siècle et le milieu du XXe siècle, qui imposaient la ségrégation raciale et privaient les Afro-Américains de leurs droits civiques.",
    "Qu'est-ce que l'apartheid ?": "L'apartheid était un système de ségrégation raciale et de discrimination institutionnalisée en Afrique du Sud, qui a duré de 1948 à 1994, et qui séparait les groupes ethniques et raciaux dans tous les aspects de la vie sociale.",
    "Quand a été abrogée la ségrégation raciale aux États-Unis ?": "La ségrégation raciale aux États-Unis a été officiellement abrogée en 1954 avec l'arrêt Brown v. Board of Education de la Cour suprême, et définitivement éliminée avec la promulgation du Civil Rights Act en 1964 et du Voting Rights Act en 1965.",
    "Qui était Rosa Parks ?": "Rosa Parks était une militante afro-américaine pour les droits civiques, célèbre pour avoir refusé de céder sa place à un passager blanc dans un bus en 1955 à Montgomery, en Alabama, ce qui a conduit au boycott des bus de Montgomery et à la fin de la ségrégation dans les transports publics.",
    "Qu'est-ce que le Mouvement des droits civiques ?": "Le Mouvement des droits civiques est un mouvement social et politique aux États-Unis qui a lutté pour mettre fin à la ségrégation raciale et pour promouvoir l'égalité des droits pour les Afro-Américains, principalement durant les années 1950 et 1960.",
    "Qui était Martin Luther King Jr. ?": "Martin Luther King Jr. était un pasteur baptiste et un leader du Mouvement des droits civiques aux États-Unis, qui a lutté pour mettre fin à la ségrégation raciale et pour promouvoir l'égalité des droits pour les Afro-Américains, notamment par des actions non violentes et des discours inspirants, comme son célèbre discours 'I Have a Dream' prononcé en 1963.",
    "Qu'est-ce que la ségrégation scolaire ?": "La ségrégation scolaire est une forme de ségrégation qui sépare les élèves en fonction de leur race ou de leur origine ethnique dans les écoles et les établissements d'enseignement.",
    "Quel rôle a joué Ruby Bridges dans la lutte contre la ségrégation ?": "Ruby Bridges est devenue un symbole de la lutte contre la ségrégation scolaire en 1960, lorsqu'à l'âge de six ans, elle est devenue la première enfant afro-américaine à fréquenter une école élémentaire blanche dans le sud des États-Unis, à la suite de l'arrêt Brown v. Board of Education.",
    "Qui était Malcolm X ?": "Malcolm X était un leader afro-américain et défenseur des droits de l'homme, membre influent de la Nation de l'Islam, qui a prôné la fierté noire, l'autodétermination et l'auto-défense pour les Afro-Américains face à la discrimination et à la ségrégation.",
    "Qu'est-ce que la ségrégation de facto ?": "La ségrégation de facto est une forme de ségrégation qui existe en pratique, sans être explicitement soutenue ou imposée par la loi, et qui résulte souvent de facteurs économiques, sociaux et culturels.",
    "Qu'est-ce que la ségrégation de jure ?": "La ségrégation de jure est une forme de ségrégation qui est explicitement soutenue ou imposée par la loi, comme dans le cas des lois Jim Crow aux États-Unis ou de l'apartheid en Afrique du Sud.",
    "Qui était Nelson Mandela ?": "Nelson Mandela était un leader anti-apartheid et le premier président noir d'Afrique du Sud, élu en 1994 après avoir passé 27 ans en prison pour sa lutte contre le régime de l'apartheid.",
    "Qu'est-ce que la doctrine 'séparés mais égaux' ?": "La doctrine 'séparés mais égaux' était une doctrine juridique aux États-Unis qui justifiait la ségrégation raciale en affirmant que des installations et des services séparés pour les Blancs et les Noirs pouvaient être égaux en qualité. Elle a été établie par l'arrêt Plessy v. Ferguson en 1896 et a été renversée par l'arrêt Brown v. Board of Education en 1954.",
    "Qu'est-ce que le Little Rock Nine ?": "Le Little Rock Nine était un groupe de neuf étudiants afro-américains qui ont été les premiers à intégrer la Central High School, une école secondaire à Little Rock, en Arkansas, en 1957, après que la Cour suprême ait déclaré la ségrégation scolaire inconstitutionnelle.",
    "Quelle est la Convention relative aux droits de l'enfant ?": "La Convention relative aux droits de l'enfant est un traité international adopté par l'ONU en 1989, qui énonce les droits civils, politiques, économiques, sociaux et culturels des enfants, et qui vise à protéger et promouvoir leur bien-être.",
    "Qu'est-ce que l'éducation de la petite enfance ?": "L'éducation de la petite enfance est une approche pédagogique qui se concentre sur l'éducation et le développement des enfants de la naissance jusqu'à l'âge de huit ans, en mettant l'accent sur les expériences d'apprentissage et les interactions sociales.",
    "Quels sont les avantages de l'allaitement maternel ?": "L'allaitement maternel présente plusieurs avantages pour les nourrissons et les mères, notamment une meilleure nutrition, une protection accrue contre les infections et les maladies, un lien affectif renforcé et un moindre coût par rapport aux préparations pour nourrissons.",
    "Comment le développement du langage se produit-il chez les enfants ?": "Le développement du langage chez les enfants se produit généralement en plusieurs étapes, commençant par les gazouillis et les babillages, puis l'apprentissage des premiers mots et des phrases simples, et enfin la maîtrise d'un vocabulaire plus large et de structures grammaticales complexes.",
    "Qu'est-ce que la vaccination et pourquoi est-elle importante pour les enfants ?": "La vaccination est l'administration de vaccins qui contiennent des agents pathogènes affaiblis ou inactivés, afin de stimuler le système immunitaire et de conférer une protection contre les maladies infectieuses. Elle est importante pour les enfants, car elle les protège contre de nombreuses maladies potentiellement graves et contribue à réduire la mortalité infantile.",
    "Qu'est-ce que la discipline positive ?": "La discipline positive est une approche de l'éducation qui encourage la coopération, le respect mutuel et la communication non violente entre les parents et les enfants, en mettant l'accent sur l'établissement de limites claires, la résolution de problèmes et le renforcement des compétences socio-émotionnelles.",
    "Comment encourager la lecture chez les enfants ?": "Pour encourager la lecture chez les enfants, il est recommandé de leur lire des histoires dès leur plus jeune âge, de créer un environnement propice à la lecture, de choisir des livres adaptés à leurs intérêts et à leur niveau de compétence, et de leur montrer l'exemple en tant qu'adulte lecteur.",
    "Quelle est l'importance du jeu pour le développement de l'enfant ?": "Le jeu est important pour le développement de l'enfant, car il favorise la croissance physique, cognitive, sociale et émotionnelle, stimule la créativité et l'imagination, développe les compétences de résolution de problèmes et renforce les liens avec les pairs et les adultes.",
    "Qu'est-ce qu'un jeu vidéo ?": "Un jeu vidéo est un type de divertissement électronique interactif dans lequel les joueurs interagissent avec des images générées par ordinateur sur un écran pour accomplir des objectifs, résoudre des énigmes ou participer à des simulations.",
    "Quelle est l'histoire des jeux vidéo ?": "L'histoire des jeux vidéo remonte aux années 1950 et 1960, avec des expérimentations sur des ordinateurs de recherche, mais le secteur a réellement décollé dans les années 1970 avec l'introduction de jeux d'arcade comme Pong et Space Invaders, et la sortie de consoles de jeux à domicile comme l'Atari 2600.",
    "Qu'est-ce qu'un jeu en monde ouvert ?": "Un jeu en monde ouvert est un type de jeu vidéo qui permet aux joueurs d'explorer librement un vaste environnement virtuel, sans être contraints par des chemins prédéterminés ou des objectifs linéaires.",
    "Qu'est-ce que la réalité virtuelle dans les jeux vidéo ?": "La réalité virtuelle dans les jeux vidéo est une technologie qui permet aux joueurs de s'immerger dans un environnement 3D interactif, en utilisant un casque de réalité virtuelle qui suit les mouvements de la tête et des contrôleurs pour les mains.",
    "Quels sont les différents genres de jeux vidéo ?": "Les jeux vidéo se déclinent en plusieurs genres, tels que les jeux d'action, d'aventure, de rôle, de stratégie, de simulation, de sport, de course, de puzzle et de rythme, parmi beaucoup d'autres.",
    "Qu'est-ce qu'un jeu en ligne multijoueur ?": "Un jeu en ligne multijoueur est un type de jeu vidéo qui permet aux joueurs de se connecter et de jouer ensemble sur Internet, en coopérant ou en s'affrontant dans divers modes de jeu.",
    "Qu'est-ce qu'un speedrun ?": "Un speedrun est une pratique dans laquelle les joueurs essaient de terminer un jeu vidéo le plus rapidement possible, en utilisant souvent des techniques avancées, des raccourcis et des exploits pour gagner du temps.",
    "Qu'est-ce qu'un jeu vidéo indépendant ?": "Un jeu vidéo indépendant, ou 'indie', est un jeu vidéo développé par une personne ou une petite équipe sans le soutien financier d'un éditeur majeur, ce qui permet souvent une plus grande créativité et innovation.",
    "Comment les jeux vidéo peuvent-ils être éducatifs ?": "Les jeux vidéo peuvent être éducatifs en intégrant des concepts d'apprentissage et des compétences dans le gameplay, en encourageant la résolution de problèmes et la pensée critique, et en présentant des sujets de manière engageante et interactive.",
    "Quels sont les effets des jeux vidéo sur la santé ?": "Les effets des jeux vidéo sur la santé peuvent être positifs ou négatifs, selon le contenu du jeu, la durée de jeu et l'équilibre avec d'autres activités. Les jeux vidéo peuvent améliorer la coordination œil-main, la mémoire et l'attention, mais peuvent également contribuer à la sédentarité, à l'isolement social et à la dépendance si joués de manière excessive.",
    "Quel est le personnage principal de la série de jeux vidéo 'The Legend of Zelda' ?": "Le personnage principal de la série de jeux vidéo 'The Legend of Zelda' est Link, un jeune héros chargé de sauver la princesse Zelda et le royaume d'Hyrule de diverses menaces.",
    "Quelle est la première console de jeux vidéo de Sony ?": "La première console de jeux vidéo de Sony est la PlayStation, sortie en 1994 au Japon et en 1995 en Amérique du Nord et en Europe.",
    "Quel est le créateur de la franchise de jeux vidéo 'Super Mario' ?": "Le créateur de la franchise de jeux vidéo 'Super Mario' est Shigeru Miyamoto, un développeur de jeux vidéo japonais travaillant pour Nintendo.",
    "Quel est le nom du personnage principal dans la série de jeux vidéo 'Assassin's Creed' ?": "Il n'y a pas de personnage principal unique dans la série de jeux vidéo 'Assassin's Creed', car chaque épisode présente un nouvel assassin dans un contexte historique différent. Cependant, Desmond Miles est un personnage récurrent qui relie les histoires des différents assassins.",
    "Quel est le nom du monde dans lequel se déroule le jeu vidéo 'World of Warcraft' ?": "Le nom du monde dans lequel se déroule le jeu vidéo 'World of Warcraft' est Azeroth.",
    "Quelle est la principale différence entre 'Pokémon Épée' et 'Pokémon Bouclier' ?": "La principale différence entre 'Pokémon Épée' et 'Pokémon Bouclier' réside dans les Pokémon exclusifs à chaque version et dans certaines différences mineures concernant les événements du scénario.",
    "Dans quel jeu vidéo apparaît le personnage de Solid Snake ?": "Le personnage de Solid Snake apparaît pour la première fois dans le jeu vidéo 'Metal Gear', développé par Hideo Kojima et publié en 1987.",
    "Qu'est-ce que le 'Battle Royale' dans les jeux vidéo ?": "Le 'Battle Royale' est un genre de jeu vidéo dans lequel un grand nombre de joueurs sont largués sur un terrain de jeu et doivent s'affronter jusqu'à ce qu'il ne reste qu'un seul joueur ou équipe en vie, comme dans les jeux 'Fortnite' et 'PlayerUnknown's Battlegrounds' (PUBG).",
    "Quelle est l'origine du jeu vidéo 'Tetris' ?": "Le jeu vidéo 'Tetris' a été créé par le programmeur russe Alexey Pajitnov en 1984.",
    "Dans quel jeu vidéo l'Enclave est-elle un antagoniste majeur ?": "L'Enclave est un antagoniste majeur dans le jeu vidéo 'Fallout 2' et réapparaît également dans 'Fallout 3'."
}